Revit 2027 API
StructuralSettings.BoundaryConditionFamilySymbolFixed Property
 The id of the FamilySymbol to represent a fixed boundary condition.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId BoundaryConditionFamilySymbolFixed { get; set; }
Public Property BoundaryConditionFamilySymbolFixed As ElementId
	Get
	Set
public:
property ElementId^ BoundaryConditionFamilySymbolFixed {
	ElementId^ get ();
	void set (ElementId^ value);
}
member BoundaryConditionFamilySymbolFixed : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace